The  NurbSpline  type exposes the following members.
 Methods
Name  |   Description
Clone
 Returns a copy of this curve.
 (Inherited from  Curve  .)
ComputeDerivatives
 Returns the vectors describing the curve at the specified parameter.
 (Inherited from  Curve  .)
ComputeNormalizedParameter
 Computes the normalized curve parameter from the raw parameter.
 (Inherited from  Curve  .)
ComputeRawParameter
 Computes the raw parameter from the normalized parameter.
 (Inherited from  Curve  .)
Create(HermiteSpline)
 Creates a new geometric NurbSpline object from a HermiteSpline.
Create(IList XYZ , IList Double )   |     Obsolete.
 Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Create(IList XYZ , IList Double , IList Double , Int32, Boolean, Boolean)   |     Obsolete.
 Creates a new geometric NURBSpline object.
CreateCurve(HermiteSpline)
 Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(IList XYZ , IList Double )
 Creates a new geometric Curve object from NURBS curve data containing just control points and weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList Double , IList XYZ )
 Creates a new geometric Curve object from NURBS curve data, which does not include weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList Double , IList XYZ , IList Double )
 Creates a new geometric Curve object from NURBS curve data, which includes weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateOffset
 Creates a new curve that is an offset of the existing curve.
 (Inherited from  Curve  .)
CreateReversed
 Creates a new curve with the opposite orientation of the existing curve.
 (Inherited from  Curve  .)
CreateTransformed
 Crates a new instance of a curve as a transformation of this curve.
 (Inherited from  Curve  .)
Dispose
 Causes the object to release immediately any resources it may be utilizing.
 (Inherited from  APIObject  .)
Distance
 Returns the shortest distance from the specified point to this curve.
 (Inherited from  Curve  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  GeometryObject  .)
Evaluate
 Evaluates and returns the point that matches a parameter along the curve.
 (Inherited from  Curve  .)
GetEndParameter
 Returns the raw parameter value at the start or end of this curve.
 (Inherited from  Curve  .)
GetEndPoint
 Returns the 3D point at the start or end of this curve.
 (Inherited from  Curve  .)
GetEndPointReference
 Returns a stable reference to the start point or the end point of the curve.
 (Inherited from  Curve  .)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from  GeometryObject  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
Intersect(Curve)
 Calculates the intersection of this curve with the specified curve.
 (Inherited from  Curve  .)
Intersect(Curve, IntersectionResultArray )
 Calculates the intersection of this curve with the specified curve and returns the intersection results.
 (Inherited from  Curve  .)
IsInside(Double)
 Indicates whether the specified parameter value is within this curve's bounds.
 (Inherited from  Curve  .)
IsInside(Double, Int32 )
 Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
 (Inherited from  Curve  .)
MakeBound
 Changes the bounds of this curve to the specified values.
 (Inherited from  Curve  .)
MakeUnbound
 Makes this curve unbound.
 (Inherited from  Curve  .)
Project
 Projects the specified point on this curve.
 (Inherited from  Curve  .)
SetControlPointsAndWeights
 Set the control points, weights simultaneously.
SetGraphicsStyleId
 Sets the graphics style id for this curve.
 (Inherited from  Curve  .)
Tessellate
 Valid only if the curve is bound. Returns a polyline approximation to the curve.
 (Inherited from  Curve  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  NurbSpline Class
  Autodesk.Revit.DB Namespace